# 3. Напишите программу, в которой пользователь будет задавать две строки,
#    программа - определять количество вхождений одной строки в другой.

a = input('Введите первое выражение: ')
b = input('Введите второе выражение: ')
print (a.count(b))